Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладахПартии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
// Возвращает список обязательных реквизитов
Функция ОбязательныеРеквизиты() Экспорт
	Массив = Новый Массив;
	Массив.Добавить("Поставщик");
	Возврат Массив;
КонецФункции
// Возвращает обязательные реквизиты табличных частей
Функция ОбязательныеРеквизитыТЧ() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Товары", СтрРазделить("Номенклатура,Количество,Цена", ","));
	Возврат Структура;
КонецФункции

Функция ТаблицаДляПроведения(Ссылка,Период, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество,
	|	ТЧ.Цена КАК Цена,
	|	ТЧ.Сумма КАК Сумма,
	|	&Ссылка КАК Партия,
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|	ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары КАК ТЧ
	| ГДЕ
	| ТЧ.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ Номенклатура, Количество, Сумма, ВидДвижения, Период ИЗ ВТ_Данные
	|УПОРЯДОЧИТЬ ПО Номенклатура
	|;
	|ВЫБРАТЬ * ИЗ ВТ_Данные
	|УПОРЯДОЧИТЬ ПО Номенклатура";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Пакет = Запрос.ВыполнитьПакет();
	Результат = Новый Структура;
	Результат.Вставить("ТоварыНаСкладах", Пакет[1].Выгрузить());
	Результат.Вставить("ТоварыНаСкладахПартии", Пакет[2].Выгрузить());
	Возврат Результат;
КонецФункции
